package ru.netology.delivery.data;

import lombok.Data;

import java.util.ArrayList;
import java.util.List;

@Data

public class City {
    String[] cities = {"Абакан", "Анадырь", "Архангельск", "Астрахань",
            "Барнаул", "Белгород", "Биробиджан", "Благовещенск", "Брянск", "ВеликийНовгород",
            "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Вологда", "Воронеж",
            "Горно-Алтайск", "Грозный", "Екатеринбург", "Иваново", "Ижевск", "Иркутск", "Йошкар-Ола",
            "Казань", "Калининград", "Калуга", "Кемерово", "Киров", "Кострома", "Краснодар",
            "Красноярск", "Курган", "Курск", "Кызыл", "Липецк", "Магадан", "Магас", "Майкоп", "Махачкала",
            "Москва", "Мурманск", "Нальчик", "Нарьян-Мар", "НижнийНовгород", "Новосибирск", "Омск", "Орёл",
            "Оренбург", "Пенза", "Пермь", "Петрозаводск", "Петропавловск-Камчатский", "Псков", "Ростов-на-Дону",
            "Рязань", "Салехард", "Самара", "Санкт-Петербург", "Саранск", "Саратов", "Севастополь", "Симферополь",
            "Смоленск", "Ставрополь", "Сыктывкар", "Тамбов", "Тверь", "Томск", "Тула", "Тюмень", "Улан-Удэ",
            "Ульяновск", "Уфа", "Хабаровск", "Ханты-Мансийск", "Чебоксары", "Челябинск", "Черкесск", "Чита",
            "Элиста", "Южно-Сахалинск", "Якутск", "Ярославль"};
}
